data/perf/campaign-f3deebfbab60/flag-mysql/mysql/tsan-nofe/run1/oltp_read_write.txt
Sysbench script: /usr/share/sysbench/oltp_read_write.lua
sysbench /usr/share/sysbench/oltp_read_write.lua --mysql-user=root --mysql-socket=/tmp/mysql.sock  --threads=36 --time=180 --rand-type=special run | awk '/Latency \(ms\):/ { exit; } 1'
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 36
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            91322
        write:                           26072
        other:                           13038
        total:                           130432
    transactions:                        6515   (36.09 per sec.)
    queries:                             130432 (722.59 per sec.)
    ignored errors:                      8      (0.04 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          180.5020s
    total number of events:              6515

MySQL build: ..